{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Professional</span> Experience",
            "description": "A look into my work experience and career journey."
        },

        "es": {
            "title": "<span class='text-primary'>Experiencia</span> Profesional",
            "description": "Un vistazo a mi experiencia laboral y trayectoria profesional."
        },

        "pt": {
            "title": "<span class='text-primary'>Experiência</span> Profissional",
            "description": "Um olhar sobre a minha experiência de trabalho e trajetória de carreira."
        }
    },

    "items": [
        {
            "id": "experience_item_1",
            "place": "@link{places.OUTSMARTIS}",
            "period": ["2021/02", "2021/06"],
            "locales": {
                "en": {
                    "title": "Curricular Internship",
                    "description": "Internship for initiating the development of websites with the JavaScript framework Vue.Js integrated in the Curricular Intern- ship of the 3rd year of the Degree in Communication and Multimedia Website development and its respective Backoce with the inte- gration of a REST API",
                    "tags": ["Vue.js", "Rest API Integration"]
                },
                "es": {
                    "title": "Pasantía Curricular",
                    "description": "Pasantía para iniciar el desarrollo de sitios web con el framework JavaScript Vue.Js integrado en la Pasantía Curricular del 3er año de la Licenciatura en Comunicación y Multimedia. Desarrollo de sitios web y su respectivo Backoffice con la integración de una API REST.",
                    "tags": ["Vue.js", "Integración de API REST"]
                },
                "pt": {
                    "title": "Estágio Curricular",
                    "description": "Estágio para iniciar o desenvolvimento de websites com o framework JavaScript Vue.Js integrado no Estágio Curricular do 3º ano da Licenciatura em Comunicação e Multimédia. Desenvolvimento de websites e respetivo Backoffice com a integração de uma API REST.",
                    "tags": ["Vue.js", "Integração de API REST"]
                }
            }
        },

        {
            "id": "experience_item_2",
            "place": "@link{places.OUTSMARTIS}",
            "period": ["2021/07", "2022/04"],
            "locales": {
                "en": {
                    "title": "Professional Internship",
                    "description": "First contact with several projects with E-commerce integrating services like Stripe for online payments",
                    "tags": ["Vue.js", "Rest API Integration", "Stripe"]
                },
                "es": {
                    "title": "Pasantía Profesional",
                    "description": "Primer contacto con varios proyectos de E-commerce integrando servicios como Stripe para pagos en línea",
                    "tags": ["Vue.js", "Integración de API Rest", "Stripe"]
                },
                "pt": {
                    "title": "Estágio Profissional",
                    "description": "Primeiro contacto com vários projetos de E-commerce integrando serviços como o Stripe para pagamentos online",
                    "tags": ["Vue.js", "Integração de API Rest", "Stripe"]
                }
            }
        },

        {
            "id": "experience_item_3",
            "place": "@link{places.OUTSMARTIS}",
            "period": ["2022/04", "2025/02"],
            "locales": {
                "en": {
                    "title": "Front-End Developer",
                    "description": "• Web application development using JavaScript frameworks Vue.Js or React.js for creating single-page applications and Bootstrap or Tailwind CSS frameworks for responsive Front-End applications and mobile-rst websites </br>• REST APIs integration </br>• Integration of payment methods such as Stripe </br>• Utilization of 3D tools like Three.js </br>• Development of both client-side and server-side websites </br>• Created several projects in the hospitality management eld, implementing user interfaces for managing statistics, employees, expenses, rooms, hotel chains, inventory, and AI-driven price suggestions </br>• Developed a tool for creating social media content with AI assistance </br>• Some experience with C# for developing console applications </br>• Helped in the maintenance of some websites in PHP",
                    "tags": ["Vue.js", "React.js", "Three.js", "Nuxt.js", "Next.js", "C#", "PHP", "Tailwind", "Bootstrap"]
                },
                "es": {
                    "title": "Front-End Developer",
                    "description": "• Desarrollo de aplicaciones web utilizando frameworks de JavaScript Vue.Js o React.js para crear aplicaciones de una sola página y frameworks de CSS Bootstrap o Tailwind para aplicaciones Front-End responsivas y sitios web móviles </br>• Integración de APIs REST </br>• Integración de métodos de pago como Stripe </br>• Utilización de herramientas 3D como Three.js </br>• Desarrollo de sitios web tanto del lado del cliente como del servidor </br>• Creación de varios proyectos en el campo de la gestión hotelera, implementando interfaces de usuario para gestionar estadísticas, empleados, gastos, habitaciones, cadenas hoteleras, inventario y sugerencias de precios impulsadas por IA </br>• Desarrollo de una herramienta para crear contenido en redes sociales con asistencia de IA </br>• Algo de experiencia con C# para desarrollar aplicaciones de consola </br>• Ayuda en el mantenimiento de algunos sitios web en PHP",
                    "tags": ["Vue.js", "React.js", "Three.js", "Nuxt.js", "Next.js", "C#", "PHP", "Tailwind", "Bootstrap"]
                },
                "pt": {
                    "title": "Front-End Developer",
                    "description": "• Desenvolvimento de aplicações web utilizando frameworks JavaScript Vue.Js ou React.js para criar aplicações de página única e frameworks CSS Bootstrap ou Tailwind para aplicações Front-End responsivas e websites mobile-first </br>• Integração de APIs REST </br>• Integração de métodos de pagamento como Stripe </br>• Utilização de ferramentas 3D como Three.js </br>• Desenvolvimento de websites tanto do lado do cliente como do servidor </br>• Criação de vários projetos na área de gestão hoteleira, implementando interfaces de utilizador para gerir estatísticas, funcionários, despesas, quartos, cadeias hoteleiras, inventário e sugestões de preços impulsionadas por IA </br>• Desenvolvimento de uma ferramenta para criar conteúdo em redes sociais com assistência de IA </br>• Alguma experiência com C# para desenvolver aplicações de consola </br>• Ajuda na manutenção de alguns websites em PHP",
                    "tags": ["Vue.js", "React.js", "Three.js", "Nuxt.js", "Next.js", "C#", "PHP", "Tailwind", "Bootstrap"]
                }
            }
        },
        {
            "id": "experience_item_4",
            "place": "@link{places.CODEWIN}",
            "period": ["2025/03", "current"],
            "locales": {
                "en": {
                    "title": "Front-End Developer",
                    "description": "• Collaborated in cross-functional teams to design and implement scalable frontend solutions for large public sector platforms using modern frameworks (React, TypeScript, Vue 3). </br>• Developed and maintained micro-frontends, integrating them seamlessly with core applications and backend services. </br>• Leveraged OpenAPI-generated services for robust API integration, ensuring scalable and maintainable codebases. </br> • Built complex form workflows, data-driven interfaces, and interactive simulators, focusing on accessibility and user experience. </br>• Applied best practices in UI development, including responsive design, component reusability, and efficient state management. </br>• Contributed to both core platform features and specialized modules, adapting to evolving requirements and collaborating closely with backend and product teams.",
                    "tags": ["Vue.js", "React.js", "Next.js", "TypeScript", "Style Components"]
                },
                "es": {
                    "title": "Front-End Developer",
                    "description": "• Colaboré en equipos multifuncionales para diseñar e implementar soluciones frontend escalables para grandes plataformas del sector público utilizando frameworks modernos (React, TypeScript, Vue 3). </br>• Desarrollé y mantuve micro-frontends, integrándolos perfectamente con aplicaciones principales y servicios backend. </br>• Aproveché servicios generados por OpenAPI para una integración robusta de API, asegurando bases de código escalables y mantenibles. </br>• Construí flujos de trabajo de formularios complejos, interfaces basadas en datos y simuladores interactivos, enfocándome en la accesibilidad y la experiencia del usuario. </br>• Apliqué mejores prácticas en el desarrollo de interfaces de usuario, incluyendo diseño responsivo, reutilización de componentes y gestión eficiente del estado. </br>• Contribuí tanto a las características principales de la plataforma como a módulos especializados, adaptándome a requisitos en evolución y colaborando estrechamente con equipos de backend y producto.",
                    "tags": ["Vue.js", "Next.js", "TypeScript", "Style Components"]
                },
                "pt": {
                    "title": "Front-End Developer",
                    "description": "• Colaborei em equipas multifuncionais para projetar e implementar soluções frontend escaláveis para grandes plataformas do setor público utilizando frameworks modernos (React, TypeScript, Vue 3). </br>• Desenvolvi e mantive micro-frontends, integrando-os perfeitamente com aplicações principais e serviços backend. </br>• Aproveitei serviços gerados pelo OpenAPI para uma integração robusta de APIs, garantindo bases de código escaláveis e fáceis de manter. </br>• Construí fluxos de trabalho de formulários complexos, interfaces orientadas por dados e simuladores interativos, com foco na acessibilidade e na experiência do utilizador. </br>• Apliquei as melhores práticas no desenvolvimento de interfaces de utilizador, incluindo design responsivo, reutilização de componentes e gestão eficiente de estado. </br>• Contribuí tanto para as funcionalidades principais da plataforma como para módulos especializados, adaptando-me a requisitos em evolução e colaborando de perto com as equipas de backend e produto.",
                    "tags": ["Vue.js", "React.js", "Next.js", "TypeScript", "Style Components"]
                }
            }
        }
    ]
}