{
    "locales": {
        "en": {
            "title": "My <span class='text-primary'>Portfolio</span>",
            "description": "These are some of the projects I've been involved in."
        },
        "es": {
            "title": "Mi <span class='text-primary'>Portafolio</span>",
            "description": "Estos son algunos de los proyectos en los que he estado involucrado."
        },
        "pt": {
            "title": "Meu <span class='text-primary'>Portfólio</span>",
            "description": "Estes são alguns dos projetos nos quais estive envolvido."
        }
    },

    "subcategories": [
        {
            "id": "webApplications",
            "locales": {
                "en": {"title": "Web Applications"},
                "es": {"title": "Aplicaciones Web"},
                "pt": {"title": "Aplicações Web"}
            }
        },
        {
            "id": "managementSystems",
            "locales": {
                "en": {"title": "Management Systems"},
                "es": {"title": "Sistemas de Gestión"},
                "pt": {"title": "Sistemas de Gestão"}
            }
        },
        {
            "id": "personalProjects",
            "locales": {
                "en": {"title": "Personal Projects"},
                "es": {"title": "Proyectos Personales"},
                "pt": {"title": "Projetos Pessoais"}
            }
        }
    ],

    "items": {
        "webApplications": [
            {
                "id": "wilddouro",
                "title": "Wilddouro",
                "logoUrl": "images/portfolio/wilddouro.svg",
                
                "locales": {
                    "en": {
                        "description": "<b>Wilddouro</b> is a tourism agency that specializes in creating programs that operate in Continental Portugal. This web application was developed from scratch using the JavaScript framework Vue.js and the CSS framework Bootstrap. For payment processing, Stripe was used. All content is managed through an administration panel also made in Vue.js, making requests to the REST API.",
                        "tags": ["Vue.js", "Bootstrap", "Stripe", "REST API"]
                    },
                    "es": {
                        "description": "<b>Wilddouro</b> es una agencia de turismo que se dedica a crear programas que actúan en Portugal Continental. Esta aplicación web fue desarrollada desde cero utilizando el framework de JavaScript, Vue.js y el framework de CSS, Bootstrap. Para la realización de los pagos se utilizó Stripe. Todo el contenido es gestionado a través de un panel de administración hecho también en Vue.js, haciendo peticiones a la REST API.",
                        "tags": ["Vue.js", "Bootstrap", "Stripe", "REST API"]
                    },
                    "pt": {
                        "description": "A <b>Wilddouro</b> é uma agência de turismo que se dedica a criar programas que atuam em Portugal Continental. Esta aplicação web foi desenvolvida de raíz utilizando a framework de JavaScript, Vue.js e a framework de CSS, Bootstrap. Para a realização dos pagamentos foi utilizado o Stripe. Todo o conteúdo é gerido através de um painel de administração feito também em Vue.js, fazendo pedidos à REST API.",
                        "tags": ["Vue.js", "Bootstrap", "Stripe", "REST API"]
                    }
                }
            },

            {
                "id": "factoryplay",
                "title": "FactoryPlay",
                "logoUrl": "images/portfolio/factoryplay.svg",
                "links": [
                    {"faIcon": "fa-solid fa-globe", "href": "https://factoryplay.com", "id": "Website"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Factoryplay</b> is a company that manufactures custom inflatables. This web application was developed from scratch using the JavaScript framework Vue.js and the CSS framework Bootstrap. For payment processing, EasyPay was used. All content is managed through an administration panel also made in Vue.js, making requests to the REST API just like the application. This application also features a 3d simulator where the user can interact with a product in case it has an associated model and thus customize it and make their purchase consequently.",
                        "tags": ["Vue.js", "EasyPay", "Bootstrap", "Three.js", "REST API"]
                    },
                    "es": {
                        "description": "<b>Factoryplay</b> es una empresa que fabrica inflables a medida. Esta aplicación web fue desarrollada desde cero utilizando el framework de JavaScript, Vue.js y el framework de CSS, Bootstrap. Para la realización de los pagos se utilizó la EasyPay. Todo el contenido es gestionado a través de un panel de administración hecho también en Vue.js, haciendo pedidos a la REST API tal como la aplicación. Esta aplicación tiene presente también un simulador 3d donde el usuario puede interactuar con un producto en caso de que este tenga un modelo asociado y así personalizarlo y efectuar su compra consecuentemente.",
                        "tags": ["Vue.js", "EasyPay", "Bootstrap", "Three.js", "REST API"]
                    },
                    "pt": {
                        "description": "<b>A Factoryplay</b> é uma empresa que fabrica insufláveis à media. Esta aplicação web foi desenvolvida de raíz utilizando a framework de JavaScript, Vue.js e a framework de CSS, Bootstrap. Para a realização dos pagamentos foi utilizada a EasyPay. Todo o conteúdo é gerido através de um painel de administração feito também em Vue.js, fazendo pedidos à REST API tal como a aplicação. Esta aplicação tem presente também um simulador 3d onde o utilizador pode interagir com um produto caso este tenha um modelo associado e assim personalizá-lo e efetuar a sua compra consequentemente.",
                        "tags": ["Vue.js", "EasyPay", "Bootstrap", "Three.js", "REST API"]
                    }
                }
            },
            {
                "id": "paack",
                "title": "Paack",
                "logoUrl": "images/portfolio/paack.svg",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"},
                    {"faIcon": "fa-brands fa-windows", "href": "https://windows.com", "id": "Windows Store"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Paack</b>",
                        "tags": ["Next.js", "Tailwind", "REST API", "Stripe"]
                    },
                    "es": {
                        "description": "<b>Paack</b>",
                        "tags": ["Next.js", "Tailwind", "REST API", "Stripe"]
                    },
                    "pt": {
                        "description": "<b>Paack</b> é um produto da empresa Outsmartis que se foca em tornar a vida de criadores de conteúdo digital e agências mais fácil através de ajuda da inteligência artificial seja na criação do conteúdo, imagens, correções linguísticas ou traduções. Esta aplicação web foi desenvolvida de raíz utilizando a framework de JavaScript, Next.js e a framework de CSS, Tailwind. Para a realização dos pagamentos foi utilizado o Stripe. Todo o conteúdo é gerido através de um painel de administração feito também em Vue.js, fazendo pedidos à REST API tal como a aplicação.",
                        "tags": ["Next.js", "Tailwind", "REST API", "Stripe"]
                    }
                }
            },

            {
                "id": "numao",
                "title": "Cooperativa Freixo de Numao",
                "logoUrl": "images/portfolio/numao.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Snappy</b> is your ultimate photography app, empowering you to capture and edit stunning images effortlessly. With its intuitive interface, Snappy provides a wide range of powerful tools and filters to enhance your photos and bring out your creativity. Whether you're a professional photographer or just a hobbyist, Snappy offers features like manual controls, advanced editing options, and AI-powered enhancements to take your photography to the next level.",
                        "tags": ["app", "photography", "camera"]
                    },
                    "es": {
                        "description": "<b>Snappy</b> es tu aplicación definitiva de fotografía, que te permite capturar y editar imágenes impresionantes sin esfuerzo. Con su interfaz intuitiva, Snappy ofrece una amplia gama de herramientas y filtros poderosos para mejorar tus fotos y potenciar tu creatividad. Ya seas un fotógrafo profesional o simplemente un aficionado, Snappy ofrece funciones como controles manuales, opciones de edición avanzadas y mejoras impulsadas por inteligencia artificial para llevar tu fotografía al siguiente nivel.",
                        "tags": ["aplicación", "fotografía", "cámara"]
                    },
                    "pt": {
                        "description": "<b>Snappy</b> est votre application ultime de photographie, vous permettant de capturer et d'éditer des images époustouflantes sans effort. Avec son interface intuitive, Snappy propose une large gamme d'outils puissants et de filtres pour améliorer vos photos et stimuler votre créativité. Que vous soyez un photographe professionnel ou simplement un amateur, Snappy offre des fonctionnalités telles que les commandes manuelles, les options d'édition avancées et les améliorations alimentées par l'IA pour pousser votre photographie à un niveau supérieur.",
                        "tags": ["application", "photographie"]
                    }
                }
            },
            {
                "id": "mindBoard",
                "title": "Mindboard",
                "logoUrl": "images/portfolio/mindboard.svg",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "Step into the electrifying world of rock music with <b>RockVerse</b>! This app is a haven for rock enthusiasts, offering a vast collection of classic and modern rock tracks, curated playlists, and behind-the-scenes content. Whether you're a die-hard fan or just discovering the genre, <b>RockVerse</b> brings you closer to the heart and soul of rock and roll. Crank up the volume and let the rock 'n' roll spirit run wild!",
                        "tags": ["app", "music", "rock", "entertainment"]
                    },
                    "es": {
                        "description": "¡Adéntrate en el electrizante mundo de la música rock con <b>RockVerse</b>! Esta aplicación es un refugio para los entusiastas del rock, ofreciendo una amplia colección de canciones de rock clásicas y modernas, listas de reproducción seleccionadas y contenido detrás de escena. Ya seas un fanático acérrimo o estés descubriendo el género, <b>RockVerse</b> te acerca al corazón y alma del rock and roll. ¡Sube el volumen y deja que el espíritu del rock 'n' roll se desate!",
                        "tags": ["aplicación", "música", "rock", "entretenimiento"]
                    },
                    "pt": {
                        "description": "Plongez dans le monde électrisant de la musique rock avec <b>RockVerse</b> ! Cette application est un paradis pour les amateurs de rock, offrant une vaste collection de pistes rock classiques et modernes, des listes de lecture sélectionnées et du contenu en coulisses. Que vous soyez un fan inconditionnel ou que vous découvriez simplement le genre, <b>RockVerse</b> vous rapproche du cœur et de l'âme du rock 'n' roll. Montez le volume et laissez l'esprit du rock 'n' roll s'exprimer !",
                        "tags": ["application", "musique", "rock", "divertissement"]
                    }
                }
            }   
        ],

        "managementSystems": [
            {
                "id": "revenue",
                "title": "Revenue Master",
                "logoUrl": "images/portfolio/revenue.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>MailM8</b> is your intelligent email companion, revolutionizing the way you manage and interact with your inbox. With advanced AI-powered features, <b>MailM8</b> helps you declutter your email, prioritize important messages, and compose smart replies in a breeze. Say goodbye to email overwhelm and hello to a more efficient and organized communication experience with <b>MailM8</b>.",
                        "tags": ["app", "email", "communication", "webApplications"]
                    },
                    "es": {
                        "description": "<b>MailM8</b> es tu compañero de correo electrónico inteligente, revolucionando la forma en que gestionas e interactúas con tu bandeja de entrada. Con funciones avanzadas impulsadas por inteligencia artificial, <b>MailM8</b> te ayuda a organizar tu correo electrónico, priorizar mensajes importantes y componer respuestas inteligentes con facilidad. Di adiós a la abrumadora bandeja de entrada y dale la bienvenida a una experiencia de comunicación más eficiente y organizada con <b>MailM8</b>.",
                        "tags": ["aplicación", "correo electrónico", "comunicación", "productividad"]
                    },
                    "pt": {
                        "description": "<b>MailM8</b> est votre compagnon de messagerie intelligent, révolutionnant la manière dont vous gérez et interagissez avec votre boîte de réception. Avec des fonctionnalités avancées alimentées par l'IA, <b>MailM8</b> vous aide à désencombrer votre boîte de réception, à prioriser les messages importants et à composer des réponses intelligentes en un clin d'œil. Dites adieu à la surcharge de courrier électronique et bonjour à une expérience de communication plus efficace et organisée avec <b>MailM8</b>.",
                        "tags": ["application", "courrier électronique", "communication", "productivité"]
                    }
                }
            },
            {
                "id": "materBizz",
                "title": "MaterBizz",
                "logoUrl": "images/portfolio/materbizz.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Find a Goalie</b> is your go-to app for finding and connecting with goaltenders in your area. Whether you're organizing a pickup hockey game or need a goalie for your team's practice session, this app makes it easy to search for available goaltenders, view their profiles, and send direct messages for collaboration. Get the pads on and let <b>Find a Goalie</b> help you keep the net covered!",
                        "tags": ["app", "sports", "hockey", "goalie"]
                    },
                    "es": {
                        "description": "<b>Find a Goalie</b> es tu aplicación de referencia para encontrar y conectarte con porteros en tu área. Ya sea que estés organizando un partido de hockey improvisado o necesites un portero para la sesión de práctica de tu equipo, esta aplicación facilita la búsqueda de porteros disponibles, ver sus perfiles y enviar mensajes directos para colaborar. ¡Ponte los pads y deja que <b>Find a Goalie</b> te ayude a mantener la portería cubierta!",
                        "tags": ["aplicación", "deporte", "hockey", "portero"]
                    },
                    "pt": {
                        "description": "<b>Find a Goalie</b> est votre application incontournable pour trouver et entrer en contact avec des gardiens de but de votre région. Que vous organisiez un match de hockey improvisé ou ayez besoin d'un gardien pour la séance d'entraînement de votre équipe, cette application facilite la recherche de gardiens de but disponibles, la consultation de leurs profils et l'envoi de messages directs pour la collaboration. Enfilez les pads et laissez <b>Find a Goalie</b> vous aider à garder le filet protégé !",
                        "tags": ["application", "sport", "hockey", "gardien de but"]
                    }
                }
            }
        ],

        "personalProjects": [
            {
                "id": "growbiz",
                "title": "Growbiz",
                "logoUrl": "images/portfolio/growbiz.png",
                "locales": {
                    "en": {
                        "description": "Indulge in the world of delectable desserts with <b>Sweet Scoops</b>! This app is a dessert lover's paradise, offering a wide range of mouthwatering recipes, step-by-step instructions, and videos for creating your favorite sweets. From creamy ice creams to irresistible pastries, <b>Sweet Scoops</b> has you covered for all your dessert cravings. Unleash your inner pastry chef and treat yourself to a delightful dessert experience.",
                        "tags": ["app", "food", "desserts", "recipes"]
                    },
                    "es": {
                        "description": "¡Déjate llevar al mundo de los postres deliciosos con <b>Sweet Scoops</b>! Esta aplicación es el paraíso de los amantes de los postres, ofreciendo una amplia gama de recetas deliciosas, instrucciones paso a paso y videos para crear tus dulces favoritos. Desde cremosos helados hasta irresistibles pasteles, <b>Sweet Scoops</b> tiene todo lo que necesitas para satisfacer tus antojos de postres. Libera al chef de repostería que llevas dentro y date un caprichoso y delicioso experiencia de postre.",
                        "tags": ["aplicación", "comida", "postres", "recetas"]
                    },
                    "pt": {
                        "description": "Indulgez-vous dans le monde des desserts délectables avec <b>Sweet Scoops</b> ! Cette application est le paradis des amateurs de desserts, offrant une large gamme de recettes alléchantes, d'instructions étape par étape et de vidéos pour créer vos douceurs préférées. Des glaces crémeuses aux pâtisseries irrésistibles, <b>Sweet Scoops</b> vous couvre pour toutes vos envies de dessert. Libérez le chef pâtissier qui sommeille en vous et offrez-vous une délicieuse expérience de dessert.",
                        "tags": ["application", "nourriture", "desserts", "recettes"]
                    }
                }
            }
        ]
    }
}